Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface.Modify Method
 Modifies the grid plane with the given ID.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace